interface UpdateHistoryList {
  date: string;
  desc: string;
}

export const updateHistoryList: UpdateHistoryList[] = [
  {
    date: "2026/03/25",
    desc: "プレシャスシーンに[全力応援！]白水六花を追加。",
  },
  {
    date: "2026/03/22",
    desc: "全国高校生課外活動コンテストの風向きアイテムのデータを2026年3月版に差し替え。",
  },
  {
    date: "2026/03/20",
    desc: "ぷちセンバツの応援力効果にタイプ系および学年系の片面中UPを追加。Lv22の数値は暫定値。",
  },
  {
    date: "2026/02/24",
    desc: "散策♪聖櫻ワールドの天気データを2026年2月版に差し替え。",
  },
  {
    date: "2026/02/22",
    desc: "プレシャスシーンに[至福の時間]村上文緒を暫定値で追加。",
  },
  {
    date: "2026/01/23",
    desc: "プレシャスシーンに[頼れる先輩]夏海&睦を暫定値で追加。",
  },
  {
    date: "2026/01/01",
    desc: "声援データに単タイプ、主+副1、攻援超スーパー特大+UPを追加。",
  },
  {
    date: "2025/12/29",
    desc: "プレシャスシーンに[小指の約束]浅見景を暫定値で追加。",
  },
  {
    date: "2025/11/26",
    desc: "散策♪聖櫻ワールドの天気データを2025年11月版に差し替え。",
  },
  {
    date: "2025/11/16",
    desc: "プレシャスシーンに[高鳴る鼓動]真白透子を追加。",
  },
  {
    date: "2025/11/02",
    desc: "プレシャスシーンに[私好みに]上条るい、[13周年]メモリアルを追加。[アツい展開]姫島木乃子の減衰係数を変更。",
  },
  {
    date: "2025/09/27",
    desc: "フレンドぷちガールちゃんのレアリティUR周りの数値を一部差し替え。",
  },
  {
    date: "2025/09/21",
    desc: "全国高校生課外活動コンテストの風向きアイテムのデータを2025年9月版に差し替え。",
  },
  {
    date: "2025/08/30",
    desc: "ぷちセンバツの応援力効果をレアリティ設定からLv選択式に変更。プレシャスシーンに[アツい展開]姫島木乃子を暫定値で追加。",
  },
  {
    date: "2025/08/18",
    desc: "プレシャスシーンに[総選挙2024]メモリアルを追加。",
  },
  {
    date: "2025/07/18",
    desc: "プレシャスシーンに[伝えたくて]玉井麗巳を追加。[勘違いﾊﾟﾆｯｸ]加賀美茉莉の減衰係数を変更。",
  },
  {
    date: "2025/07/01",
    desc: "声援データに単タイプ、主+副1、攻守超スーパー特大UPを追加。",
  },
  {
    date: "2025/06/26",
    desc: "散策♪聖櫻ワールドの天気データを2025年6月版に差し替え。",
  },
  {
    date: "2025/06/13",
    desc: "リニューアル版でのたすけて！マイヒーロー、全国高校生課外活動コンテスト用のページを追加。",
  },
  {
    date: "2025/06/08",
    desc: "リニューアル版での部活対抗！勧誘★グランプリと聖櫻学園★カリスマ決定戦、聖櫻学園メモリアルストーリー、散策♪聖櫻ワールド、通常バトル用のページを追加。",
  },
  {
    date: "2025/06/01",
    desc: "リニューアル版でのおねがい★ハンターズ用のページを追加。",
  },
] as const;
